# =========================================================================== #
# `navi` - interactive cheatsheet tool for the cmd and application launchers
# --------------------------------------------------------------------------
# https://github.com/denisidoro/navi
# -----
# USES: Rust Shell
# MANPAGE: No
# COMPLETIONS: No
# =========================================================================== #
navi-bin

# =========================================================================== #
# `fd` -  simple, fast and user-friendly alternative to `find`
# ------------------------------------------------------------
# https://github.com/sharkdp/fd
# -----
# USES: Rust
 MANPAGE: Yes
# COMPLETIONS: Yes
# =========================================================================== #
fd

# =========================================================================== #
# `ag` - code-searching tool similar to `ack`, but faster
# -------------------------------------------------------
# https://github.com/ggreer/the_silver_searcher
# -----
# USES: C
# MANPAGE: Yes
# COMPLETIONS: Yes
# =========================================================================== #
the_silver_searcher

# =========================================================================== #
# `rg` - recursively searching directories for a regex pattern with gitignore
# ---------------------------------------------------------------------------
# https://github.com/BurntSushi/ripgrep
# -----
# USES: Rust
# MANPAGE: Yes
# COMPLETIONS: Yes
# =========================================================================== #
ripgrep

# =========================================================================== #
# `rga` - also search in PDFs, E-Books, Office documents, zip, tar.gz, etc.
# -------------------------------------------------------------------------
# https://github.com/phiresky/ripgrep-all
# -----
# USES: Rust
# MANPAGE: Yes
# COMPLETIONS: Yes
# =========================================================================== #
ripgrep-all-bin

# =========================================================================== #
# `fzy` - simple, fast fuzzy finder for the terminal
# --------------------------------------------------
# https://github.com/jhawthorn/fzy
# https://github.com/Zsh-Packages/fzy
# ---
# USES: C
# MANPAGE: Yes
# Completions: No
# =========================================================================== #
fzy

# =========================================================================== #
# `fzf` - command-line fuzzy finder
# ---------------------------------
# https://github.com/junegunn/fzf
# ---
# USES: Go
# MANPAGE: Yes
# Completions: No
# =========================================================================== #
fzf

# =========================================================================== #
# A `cat` clone with wings
# ------------------------
# https://github.com/sharkdp/bat
# -----
# USES: Rust
# MANPAGE: Yes
# COMPLETIONS: Yes
# =========================================================================== #
bat

# =========================================================================== #
# The next generation 'ls' command
# --------------------------------
# -----
# USES: Rust
# MANPAGE: Yes
# COMPLETIONS: Yes
# =========================================================================== #
lsd-bin

# =========================================================================== #
# `procs` - a modern replacement for `ps`
# ---------------------------------------
# https://github.com/dalance/procs
# -----
# USES: Rust
# MANPAGE: No
# COMPLETIONS: Yes
# =========================================================================== #
procs-bin

# =========================================================================== #
# `tre` - a modern alternative for `tree`
# ---------------------------------------
# https://github.com/dduan/tre
# -----
# USES: Rust
# MANPAGE: Yes
# COMPLETIONS: No
# =========================================================================== #
tre-command

# =========================================================================== #
# `sd` - Intuitive find & replace CLI (sed alternative)
# -----------------------------------------------------
# https://github.com/chmln/sd
# -----
# USES: Rust
# MANPAGE: No
# COMPLETIONS: No
# =========================================================================== #
sd

# =========================================================================== #
# `dust` - A more intuitive version of Linux `du`
# -----------------------------------------------
# https://github.com/bootandy/dust
# -----
# USES: Rust
# MANPAGE: No
# COMPLETIONS: No
# =========================================================================== #
dust-bin

# =========================================================================== #
# `btm` - cross-platform graphical process/system monitor alternative to `top`
# ---------------------------------------------------------------------------
# https://github.com/ClementTsang/bottom
# -----
# USES: Rust
# MANPAGE: No
# COMPLETIONS: Yes
# =========================================================================== #
bottom-bin

# =========================================================================== #
# `nnn` (n³) -the unorthodox terminal file manager
# ------------------------------------------------
# https://github.com/jarun/nnn
# ----
# USES: C
# MANPAGE: Yes
# COMPLETIONS: Yes
# =========================================================================== #
nnn-nerd

# =========================================================================== #
# `exa` - modern replacement for `ls`
# -----------------------------------
# https://github.com/ogham/exa
# ----
# USES: Rust
# MANPAGE: Yes
# COMPLETIONS: Yes
# =========================================================================== #
exa

# =========================================================================== #
# `pet` - simple command line snippet manager
# -------------------------------------------
# https://github.com/knqyf263/pet
# ----
# USES: Go
# MANPAGE: No
# COMPLETIONS: Yes
# =========================================================================== #
pet-bin

# =========================================================================== #
# `broot` (Broot) - a better way to navigate directories
# ---------------------------------------------------
# https://github.com/Canop/broot
# ----
# USES: Rust
# MANPAGE: Yes
# COMPLETIONS: Yes
# =========================================================================== #
broot

# =========================================================================== #
# `ruplacer` Find and replace text in source files
# ------------------------------------------------
# https://github.com/dmerejkowsky/ruplacer
# ----
# USES: Rust
# MANPAGE: No
# COMPLETIONS: No
# =========================================================================== #
ruplacer

# =========================================================================== #
# `tokei` - Count the code, quickly
# ---------------------------------
# https://github.com/XAMPPRocky/tokei
# -----
# USES: Rust
# MANPAGE: No
# COMPLETIONS: No
# =========================================================================== #
tokei

# =========================================================================== #
# `bandwhich` - Terminal bandwidth utilization tool
# -------------------------------------------------
# https://github.com/imsnif/bandwhich
# -----
# USES: Rust
# MANPAGE: No
# COMPLETIONS: No
# =========================================================================== #
bandwhich

# ======================================================================== #
# `jq` - command-line JSON processor
# ----------------------------------
# https://github.com/stedolan/jq
# -----
# USES: Go
# MANPAGE: No
# COMPLETIONS: Yes
# ======================================================================== #
jq

# ======================================================================== #
# Delta - a viewer for Git and `diff` output
# ------------------------------------------
# https://github.com/dandavison/delta
# -----
# USES: Rust
# MANPAGE: No
# ======================================================================== #
git-delta-git

# ======================================================================== #
# Terminal UI for Git's commands
# ------------------------------
# https://github.com/jesseduffield/lazygit
# -----
# USES: Go Shell
# MANPAGE: No
# Completion: No
# ======================================================================== #
lazygit-bin

# ======================================================================= #
# `gh` - GitHub's official command line tool
# ------------------------------------------
# https://github.com/cli/cli/
# -----
# USES: Go
# MANPAGE: Yes
# Completion: Yes
# ======================================================================== #
github-cli

# ======================================================================== #
#`wuzz` - interactive tool for HTTP inspection
# ---------------------------------------------
# https://github.com/asciimoo/wuzz
# -----
# USES: Go
# MANPAGE: No
# COMPLETIONS: No
# ======================================================================== #
wuzz

# =========================================================================== #
# `zoxide` - A smarter `cd` command
# ---------------------------------
# https://github.com/ajeetdsouza/zoxide
# -----
# USES: Rust
# MANPAGE: No
# COMPLETIONS: No
# =========================================================================== #
zoxide-bin

# =========================================================================== #
# `glow` - Render Markdown in the CLI
# -----------------------------------
# https://github.com/charmbracelet/glow
# -----
# USES: Go
# MANPAGE: No
# COMPLETIONS: No
# =========================================================================== #
glow-bin

rust
rustup

noddejs

python

go

spotifyd
spotify-tui

joplin

efm-langserver
